# DocumentChangedEventArgs Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentChangedEventArgs Class
Members See Also
---
The event arguments used by the DocumentChanged event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class DocumentChangedEventArgs : RevitAPISingleEventArgs
```

Visual Basic
---
```text
Public Class DocumentChangedEventArgs _
	Inherits RevitAPISingleEventArgs
```

Visual C++
---
```text
public ref class DocumentChangedEventArgs : public RevitAPISingleEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPISingleEventArgs Autodesk.Revit.DB.Events..::..DocumentChangedEventArgs
# See Also
DocumentChangedEventArgs Members
Autodesk.Revit.DB.Events Namespace